Repository: CofficLab/Cisum_SwiftUI
Catalog: Packages/PluginThemeSettings/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant_hk

source: %lld themes
zh_hans: %lld 个主题
zh_hant_hk: %lld 個主題

source: All
zh_hans: 全部
zh_hant_hk: 全部

source: Appearance
zh_hans: 外观
zh_hant_hk: 外觀

source: Black
zh_hans: 黑色
zh_hant_hk: 黑色

source: Current: %@
zh_hans: 当前：%@
zh_hant_hk: 目前：%@

source: Light
zh_hans: 浅色
zh_hant_hk: 淺色

source: No themes in this category
zh_hans: 此分类中没有主题
zh_hant_hk: 此分類中沒有主題

source: Provides theme selection and appearance settings in the settings window
zh_hans: 在设置窗口中提供主题选择与外观设置。
zh_hant_hk: 在設定視窗中提供主題選擇與外觀設定。

source: Search Themes
zh_hans: 搜索主题
zh_hant_hk: 搜尋主題

source: Switch app theme
zh_hans: 切换应用主题
zh_hant_hk: 切換應用主題

source: System
zh_hans: 跟随系统
zh_hant_hk: 跟隨系統

source: Theme
zh_hans: 主题
zh_hant_hk: 主題

source: Theme Style
zh_hans: 主题风格
zh_hant_hk: 主題風格

source: Theme Type
zh_hans: 主题类型
zh_hant_hk: 主題類型

source: No Themes Found
zh_hans: 没有找到主题
zh_hant_hk: 找不到主題

source: Select a Theme
zh_hans: 选择一个主题
zh_hant_hk: 選擇一個主題

source: Currently In Use
zh_hans: 当前使用
zh_hant_hk: 目前使用

source: Use This Theme
zh_hans: 使用此主题
zh_hant_hk: 使用此主題

source: Dark Theme
zh_hans: 深色主题
zh_hant_hk: 深色主題

source: Light Theme
zh_hans: 浅色主题
zh_hant_hk: 淺色主題

source: Follow System Appearance
zh_hans: 跟随系统外观
zh_hant_hk: 跟隨系統外觀

source: Preview how common components look with this theme
zh_hans: 查看常用组件在此主题下的效果
zh_hant_hk: 查看常用元件在此主題下的效果

source: Component Preview
zh_hans: 组件预览
zh_hant_hk: 元件預覽

source: Primary Action
zh_hans: 主要操作
zh_hant_hk: 主要操作

source: Secondary Action
zh_hans: 次要操作
zh_hant_hk: 次要操作

source: Secondary Actions
zh_hans: 辅助操作
zh_hant_hk: 輔助操作

source: Primary Color
zh_hans: 主色
zh_hant_hk: 主色

source: Accent Color
zh_hans: 辅色
zh_hant_hk: 輔色

source: Background
zh_hans: 背景
zh_hant_hk: 背景

source: Elevate
zh_hans: 抬升
zh_hant_hk: 抬升

source: Appearance Settings
zh_hans: 外观设置
zh_hant_hk: 外觀設定

source: Version
zh_hans: 版本
zh_hant_hk: 版本

source: Type
zh_hans: 类型
zh_hant_hk: 類型

source: Plugin
zh_hans: 插件
zh_hant_hk: 外掛程式

source: Core Capabilities
zh_hans: 核心能力
zh_hant_hk: 核心能力

source: Chooses an appearance from all themes.
zh_hans: 从全部主题中选择外观。
zh_hant_hk: 從全部主題中選擇外觀。

source: Theme Selection
zh_hans: 主题选择
zh_hant_hk: 主題選擇

source: Toggles between light and dark appearance.
zh_hans: 切换深浅色外观。
zh_hant_hk: 切換深淺色外觀。

source: Dark Mode
zh_hans: 深色模式
zh_hant_hk: 深色模式

source: Overview
zh_hans: 概述
zh_hant_hk: 概述

source: Theme Selection: choose an appearance from all themes.
zh_hans: 主题选择：从全部主题中选择外观。
zh_hant_hk: 主題選擇：從全部主題中選擇外觀。

source: Dark Mode: toggles between light and dark appearance.
zh_hans: 深色模式：切换深浅色外观。
zh_hant_hk: 深色模式：切換深淺色外觀。

source: Basic Operations
zh_hans: 基本操作
zh_hant_hk: 基本操作

source: Opens Appearance in the Settings window.
zh_hans: 在设置窗口中打开「外观」。
zh_hant_hk: 在設定視窗中開啟「外觀」。

source: Pick a theme you like.
zh_hans: 选择心仪的主题。
zh_hant_hk: 選擇喜歡的主題。

source: Switches between light and dark modes as needed.
zh_hans: 按需切换深浅色模式。
zh_hant_hk: 依需求切換深淺色模式。

source: Notes
zh_hans: 说明
zh_hant_hk: 說明

source: The theme applies immediately and persists.
zh_hans: 主题即时应用并持久化。
zh_hant_hk: 主題即時套用並持久化。
